<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold"><br>

Import Libraries
</p>

In [1]:
import pandas as pd

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold"><br>

Introduction to Pandas Data Structres
</p>

Pandas has two main data structures namely Series and data frames

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold"><br>

Pandas Series
</p>

One Dimensional labeled array

In [2]:
ser = pd.Series(data = [100, 200, 300, 400, 500], index = ['tom', 'bob', 'nancy', 'dan', 'eric'])

In [3]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [4]:
# or we can create same series without specifying data and index words in the Series function

ser = pd.Series([100, 200, 300, 400, 500],['tom', 'bob', 'nancy', 'dan', 'eric'])

In [5]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [6]:
# pandas series allows hetrogenoues data tyes

ser = pd.Series([100, 'foo', 300, 'bar', 500],['tom', 'bob', 'nancy', 'dan', 'eric'])
ser

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [7]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [8]:
ser['nancy']

300

In [9]:
ser[[4, 3, 1]]

eric    500
dan     bar
bob     foo
dtype: object

In [13]:
ser.loc[['nancy', 'bob']]

nancy    300
bob      foo
dtype: object

In [14]:
ser.iloc[2]

300

In [15]:
'bob' in ser

True

In [16]:
'ram' in ser

False

In [17]:
ser
ser * 2

tom         200
bob      foofoo
nancy       600
dan      barbar
eric       1000
dtype: object

In [18]:
ser[['nancy', 'eric']] ** 2

nancy     90000
eric     250000
dtype: object

## Pandas DataFrame

pandas DataFrame is two dimesnional labeled data structure

In [21]:
# Create Data from from a dictionary of Python Series

d = {'one' : pd.Series([100, 200, 300], index=['apple', 'ball', 'cloack']),
     'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy'])
    }
d

{'one': apple     100
 ball      200
 cloack    300
 dtype: int64, 'two': apple      111.0
 ball       222.0
 cerill     333.0
 dancy     4444.0
 dtype: float64}

In [22]:
df = pd.DataFrame(d)
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
cloack  300.0     NaN
dancy     NaN  4444.0

In [23]:
df.index

Index(['apple', 'ball', 'cerill', 'cloack', 'dancy'], dtype='object')

In [24]:
#outpt format changes if you use print function

df = pd.DataFrame(d)
print(df)

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
cloack  300.0     NaN
dancy     NaN  4444.0

In [25]:
df.columns

Index(['one', 'two'], dtype='object')

In [29]:
#chosing a subset of data
pd.DataFrame(d, index=['dancy', 'ball', 'apple'])

         one     two
dancy    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

In [31]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'], columns=['two', 'five'])

          two five
dancy  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

## Create DataFrame from list of python Dictionaries

In [37]:
data = [{'alex' : 1, 'joe' : 2}, {'ema' : 5, 'dora' : 10, 'alice' : 20}, {'tim' : 7, 'bil' : 9}]

In [38]:
data

[{'alex': 1, 'joe': 2},
 {'alice': 20, 'dora': 10, 'ema': 5},
 {'bil': 9, 'tim': 7}]

In [39]:
pd.DataFrame(data)

   alex  alice  bil  dora  ema  joe  tim
0   1.0    NaN  NaN   NaN  NaN  2.0  NaN
1   NaN   20.0  NaN  10.0  5.0  NaN  NaN
2   NaN    NaN  9.0   NaN  NaN  NaN  7.0

In [42]:
pd.DataFrame(data, columns=['joe', 'dora', 'alice'])

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN  10.0   20.0
2  NaN   NaN    NaN

Basic DatFrame Operation

In [43]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
cloack  300.0     NaN
dancy     NaN  4444.0

In [44]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
cloack    300.0
dancy       NaN
Name: one, dtype: float64

In [45]:
df['three'] = df['one'] * df['two']

In [46]:
df

          one     two    three
apple   100.0   111.0  11100.0
ball    200.0   222.0  44400.0
cerill    NaN   333.0      NaN
cloack  300.0     NaN      NaN
dancy     NaN  4444.0      NaN

In [47]:
df['flag'] = df['one'] > 250

In [48]:
df

          one     two    three   flag
apple   100.0   111.0  11100.0  False
ball    200.0   222.0  44400.0  False
cerill    NaN   333.0      NaN  False
cloack  300.0     NaN      NaN   True
dancy     NaN  4444.0      NaN  False

In [49]:
three = df.pop('three')

In [50]:
three

apple     11100.0
ball      44400.0
cerill        NaN
cloack        NaN
dancy         NaN
Name: three, dtype: float64

In [51]:
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
cloack  300.0     NaN   True
dancy     NaN  4444.0  False

In [52]:
del df['two']

In [53]:
df

          one   flag
apple   100.0  False
ball    200.0  False
cerill    NaN  False
cloack  300.0   True
dancy     NaN  False

In [54]:
df.insert(2, 'copy_of_one', df['one'])

In [55]:
df

          one   flag  copy_of_one
apple   100.0  False        100.0
ball    200.0  False        200.0
cerill    NaN  False          NaN
cloack  300.0   True        300.0
dancy     NaN  False          NaN

In [56]:
df['one_upper_half'] = df['one'][:2]

In [57]:
df

          one   flag  copy_of_one  one_upper_half
apple   100.0  False        100.0           100.0
ball    200.0  False        200.0           200.0
cerill    NaN  False          NaN             NaN
cloack  300.0   True        300.0             NaN
dancy     NaN  False          NaN             NaN

In [58]:
!ls

'ls' is not recognized as an internal or external command,
operable program or batch file.

In [60]:
import pandas as pd
import numpy as np

In [63]:
movies = pd.read_csv('D://Users//kanhaiya_s//Desktop//MSTraining//Data Science Course//Python For Data Science//Week-4-Pandas//ml-latest-small//movies.csv', sep=',')
print(type(movies))
movies.head(20)

<class 'pandas.core.frame.DataFrame'>

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller
10,11,"American President, The (1995)",Comedy|Drama|Romance
11,12,Dracula: Dead and Loving It (1995),Comedy|Horror
12,13,Balto (1995),Adventure|Animation|Children
13,14,Nixon (1995),Drama
14,15,Cutthroat Island (1995),Action|Adventure|Romance
15,16,Casino (1995),Crime|Drama
16,17,Sense and Sensibility (1995),Drama|Romance
17,18,Four Rooms (1995),Comedy
18,19,Ace Ventura: When Nature Calls (1995),Comedy
19,20,Money Train (1995),Action|Comedy|Crime|Drama|Thriller

In [64]:
tags = pd.read_csv('D://Users//kanhaiya_s//Desktop//MSTraining//Data Science Course//Python For Data Science//Week-4-Pandas//ml-latest-small//tags.csv', sep=',')
print(type(tags))
tags.head(20)

<class 'pandas.core.frame.DataFrame'>

    userId  movieId                      tag   timestamp
0       15      339  sandra 'boring' bullock  1138537770
1       15     1955                  dentist  1193435061
2       15     7478                 Cambodia  1170560997
3       15    32892                  Russian  1170626366
4       15    34162              forgettable  1141391765
5       15    35957                    short  1141391873
6       15    37729               dull story  1141391806
7       15    45950               powerpoint  1169616291
8       15   100365                 activist  1425876220
9       15   100365              documentary  1425876220
10      15   100365                   uganda  1425876220
11      23      150               Ron Howard  1148672905
12      68     2174                    music  1249808064
13      68     2174                    weird  1249808102
14      68     8623             Steve Martin  1249808497
15      73   107999                   action  1430799184
16      73   107999                    anime  1430799184
17      73   107999                  kung fu  1430799184
18      73   111624                    drama  1431584497
19      73   111624                    indie  1431584497

In [66]:
ratings = pd.read_csv('D://Users//kanhaiya_s//Desktop//MSTraining//Data Science Course//Python For Data Science//Week-4-Pandas//ml-latest-small//ratings.csv', sep=',', parse_dates=['timestamp'])
print(type(ratings))
ratings.head(20)

<class 'pandas.core.frame.DataFrame'>

    userId  movieId  rating   timestamp
0        1       31     2.5  1260759144
1        1     1029     3.0  1260759179
2        1     1061     3.0  1260759182
3        1     1129     2.0  1260759185
4        1     1172     4.0  1260759205
5        1     1263     2.0  1260759151
6        1     1287     2.0  1260759187
7        1     1293     2.0  1260759148
8        1     1339     3.5  1260759125
9        1     1343     2.0  1260759131
10       1     1371     2.5  1260759135
11       1     1405     1.0  1260759203
12       1     1953     4.0  1260759191
13       1     2105     4.0  1260759139
14       1     2150     3.0  1260759194
15       1     2193     2.0  1260759198
16       1     2294     2.0  1260759108
17       1     2455     2.5  1260759113
18       1     2968     1.0  1260759200
19       1     3671     3.0  1260759117

In [67]:
#for ucrrent analysis we will remove timestamp

del ratings['timestamp']
del tags['timestamp']

## Data Structure

### Series

In [68]:
#Extract 0th Row and notice that it is infact a Series:

row_0 = tags.iloc[0]
type(row_0)

pandas.core.series.Series

In [69]:
print(row_0)

userId                          15
movieId                        339
tag        sandra 'boring' bullock
Name: 0, dtype: object

In [70]:
row_0.index

Index(['userId', 'movieId', 'tag'], dtype='object')

In [75]:
row_0['userId']

15

In [76]:
row_0.name

0

## DataFrame

In [78]:
tags.head()

   userId  movieId                      tag
0      15      339  sandra 'boring' bullock
1      15     1955                  dentist
2      15     7478                 Cambodia
3      15    32892                  Russian
4      15    34162              forgettable

In [79]:
tags.index

RangeIndex(start=0, stop=1296, step=1)

In [81]:
tags.columns

Index(['userId', 'movieId', 'tag'], dtype='object')

In [85]:
# extract row 0, 11 and 2000 from dataframe
tags.iloc[[0, 11]]

    userId  movieId                      tag
0       15      339  sandra 'boring' bullock
11      23      150               Ron Howard

## Descricptive Statistics

In [88]:
ratings['rating'].describe()

count    100004.000000
mean          3.543608
std           1.058064
min           0.500000
25%           3.000000
50%           4.000000
75%           4.000000
max           5.000000
Name: rating, dtype: float64

In [89]:
ratings['rating'].mean()

3.543608255669773

In [90]:
ratings['rating'].mode()

0    4.0
dtype: float64

In [91]:
ratings.mean()

userId       347.011310
movieId    12548.664363
rating         3.543608
dtype: float64

In [92]:
ratings['rating'].min()

0.5

In [93]:
ratings['rating'].max()

5.0

In [94]:
ratings['rating'].std()

1.0580641091073735

In [95]:
ratings.corr()

           userId   movieId    rating
userId   1.000000  0.007126  0.010467
movieId  0.007126  1.000000 -0.028894
rating   0.010467 -0.028894  1.000000